html/projects/unrealizable-concepts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-03 Tue 22:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Unrealizable Concepts</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Unrealizable Concepts</h1>
<p>
These are ideas which are not realizable for one reason or another, e.g. my lack of knowledge or resources, physical infeasibility.
</p>
<div id="outline-container-org99153a7" class="outline-2">
<h2 id="org99153a7"><span class="section-number-2">1.</span> Software</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Ohm.AI: tool which can tell you the resistance of a resistor based on its color bands.
<ul class="org-ul">
<li>Integrate into AR glasses, or at least a small handheld device with a camera</li>
<li>Helps colorblind people</li>
<li>Helps everyone when the resistor band direction is unclear</li>
<li>Doesn&rsquo;t even need AI, could probably use just computer vision if only one resistor in the photo
<ul class="org-ul">
<li>Upgrade CV to detect resistors before processing them</li>
<li>Maybe better to use algorithms that detect presence and locations of certain colors, rather than trying to identify each band and then get the color from that?</li>
</ul></li>
</ul></li>
<li>DIY Professional Headshot App: phone app which helps produce the highest quality professional headshots that your phone is capable of.
<ul class="org-ul">
<li>takes a photo and can apply edits to help (brightness, noise, etc)</li>
<li>UI overlay: places guides on the screen to help make clothes, shoulders, head, and facial geometries symmetric
<ul class="org-ul">
<li>clothes
<ul class="org-ul">
<li>tie is vertical</li>
<li>lapels evenly spaced around tie</li>
</ul></li>
<li>shoulders pose
<ul class="org-ul">
<li>equally spaced within frame</li>
<li>oriented planar to phone</li>
<li>one isn&rsquo;t higher than the other</li>
</ul></li>
<li>head pose
<ul class="org-ul">
<li>centered wrto. shoulders</li>
<li>yaw and roll are zero, pitch is suitable</li>
</ul></li>
<li>facial geometries
<ul class="org-ul">
<li>smile</li>
<li>jaw</li>
</ul></li>
</ul></li>
<li>identifies lighting features to fix
<ul class="org-ul">
<li>too warm/cold</li>
<li>too many shadows</li>
<li>brighter/darker areas</li>
</ul></li>
<li>companion computer app can control the phone: view the screen, take photos, set timer, turn of camera UI overlay</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org39fb401" class="outline-2">
<h2 id="org39fb401"><span class="section-number-2">2.</span> Chemistry</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Exothermic chewing gum. Generates pleasant heat in your mouth.</li>
</ol>
</div>
</div>
<div id="outline-container-orga20eb63" class="outline-2">
<h2 id="orga20eb63"><span class="section-number-2">3.</span> Novels</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>A detective novel which involves both a real robbery and staged robbery, set in the same location at the same time. Perhaps the real robbery occurs first, and then the robbed party happens to set up a staged robbery as a joke. Or a staged robbery is set up, and then the real robbery occurs.</li>
<li>A science fiction dystopia in which the human brain remains the best AI compute chip in terms of optimizing for cost, waste heat, power efficiency, compute power, cooling, size, reliability, availability, maintainability, etc. People can rent out their brainpower to AI companies.
<ul class="org-ul">
<li>The renting could be done like in the Matrix, where you get hooked up to a physical network.</li>
<li>Or maybe the company installs a brian chip which uses some fraction of your brainpower.</li>
</ul></li>
<li>An adaptation of Charlie Chaplin&rsquo;s <a href="https://www.youtube.com/watch?v=H19jByxrqlw">Barber Shop Scene</a> set to The Four Season&rsquo;s Winter Movement 1.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="email">Email: <a href="mailto:lorenzohess@tutanota.com">lorenzohess@tutanota.com</a></p>
<p class="date">Created: 2026-02-03 Tue 22:39</p>
</div>
</body>
</html>
